In [3]:
import numpy as np
import pandas as pd

In [56]:
class Imputer():
    def __init__(self,mode="mean",ext=False):
        self.mode=mode
        self.ext=ext
        self.repl={}
        self.nullCols=[];
    def fit_transform(self,df):

        self.nullCols=[col for col in df.select_dtypes(exclude=['object','datetime']).columns if (df[col].isnull().any())]
        for i in self.nullCols:
            self.repl[i]= df[i].mean() if self.mode=='mean'  else df[i].median() if self.mode=='median' else df[i].mode()[0]
        return self.transform(df)

    def transform(self,df_in):
        df=df_in.copy()
        for i in self.nullCols:
            for j in range(0,len(df[i])):
                if pd.isna(df.loc[j,i]):
                    df.loc[j,i]=self.repl[i]
        return df

In [57]:
imp=Imputer()
imp_median=Imputer(mode='median')
imp_mode=Imputer(mode='mode')

In [58]:
data=pd.read_csv('data.csv')

In [59]:
imp.fit_transform(data)

    Age   Salary  Country Purchased
0  25.0  50000.0   France        No
1  30.0  54000.0    Spain       Yes
2  36.0  61000.0  Germany        No
3  38.0  59000.0    Spain        No
4  40.0  59000.0  Germany       Yes
5  35.0  58000.0   France       Yes
6  36.0  52000.0    India       Yes
7  48.0  79000.0   France       Yes

In [60]:
imp_median.fit_transform(data)

    Age   Salary  Country Purchased
0  25.0  50000.0   France        No
1  30.0  54000.0    Spain       Yes
2  36.5  61000.0  Germany        No
3  38.0  56000.0    Spain        No
4  40.0  56000.0  Germany       Yes
5  35.0  58000.0   France       Yes
6  36.5  52000.0    India       Yes
7  48.0  79000.0   France       Yes

In [61]:
imp_mode.fit_transform(data)

    Age   Salary  Country Purchased
0  25.0  50000.0   France        No
1  30.0  54000.0    Spain       Yes
2  25.0  61000.0  Germany        No
3  38.0  50000.0    Spain        No
4  40.0  50000.0  Germany       Yes
5  35.0  58000.0   France       Yes
6  25.0  52000.0    India       Yes
7  48.0  79000.0   France       Yes